INSERT INTO products (article, name, description, price, new_arrival)
VALUES (234234, '5.45" Смартфон HUAWEI Y5p 32 ГБ зеленый', '5.45" Смартфон HUAWEI Y 5P 32 ГБ зеленый сочетает привлекательный внешний вид с ' ||
                                                           'оригинальной расцветкой, высокую производительность и технологичность. Быстро справляться с запуском приложений ' ||
                                                           'мобильному устройству позволяют 8-ядерный процессор MediaTek Helio P22 и 2 ГБ оперативной памяти. Внутреннее ' ||
                                                           'хранилище имеет объем 32 ГБ и может быть расширено при необходимости.', 12999, true),
       (453523, '6.5" Смартфон Samsung Galaxy A02 32 ГБ красный', 'А для еще большей оперативности смартфон оснащен 2 Гб оперативной памяти и графическим ускорителем PowerVR GE8100. ' ||
                                                                  'При этом важным преимуществом смартфона является особая система из 2 основных камер на 13 и 2 Мп с автоматическим фокусом' ||
                                                                  ' и светодиодной вспышкой. Теперь вам будет доступно создание фотографий с разрешением до 4096х3072 пикселей и видеороликов ' ||
                                                                  'в режиме Full HD на частоте в 30 кадр/сек. А для хранения файлов и приложений в смартфоне уже предусмотрено 32 Гб.', 34534, false),
       (232342, '6.53" Смартфон Xiaomi Redmi 9A 32 ГБ зеленый', 'Смартфон Xiaomi Redmi 9A в светло-зеленом корпусе из пластика объединил универсальные решения, которые понравятся каждому ' ||
                                                                'пользователю. В первую очередь необходимо отметить его достойное быстродействие, благодаря которому устройство легко работает в' ||
                                                                ' десятке приложений одновременно. В основе его функционирования – процессор MediaTek Helio G25, ускоритель PowerVR GE8320 и ' ||
                                                                'сразу 2 ГБ оперативной памяти.', 9999, true),
       (45454, '6.21" Смартфон Honor 20E 64 ГБ черный', 'Смартфон Honor 20E сочетает стиль, функциональность и технологичность. Основой аппаратной платформы является процессор HiSilicon Kirin 710F' ||
                                                        ' с 8 мощными и энергоэффективными ядрами, который совместно с 4 ГБ ОЗУ гарантирует быструю работу системы. В оснащение данной модели входят ' ||
                                                        '64 ГБ памяти с возможностью расширения.', 23433, false),
       (212367, '4.7" Смартфон Apple iPhone SE 2020 64 ГБ белый', 'Смартфон Apple iPhone SE 2020 характеризуется компактными размерами и элегантным оформлением в белом цвете. Он оснащен дисплеем ' ||
                                                                  'IPS диагональю 4.7 дюйма (1334x750 пикселей), на котором отображается детализированная картинка с реалистичной цветопередачей. ' ||
                                                                  'Высокий уровень производительности системы достигается за счет мощного процессора A13 Bionic и 3 ГБ памяти ОЗУ. Вы сможете хранить ' ||
                                                                  'в устройстве довольно большой массив данных благодаря 64 ГБ встроенной памяти.', 53432, true);